app/controllers/v1/contacts_controller.rb

def create
	@contact=Contact.new(contact_params)
	@contact.save
---
INSERT INTO "contacts" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Hammmad"], ["last_name", "ddff"], ["email", "hm@gmail.com"], ["created_at", "2018-07-24 10:27:05.087279"], ["updated_at", "2018-07-24 10:27:05.087279"]]

def destroy
	@contact=Contact.where(id: params[:id]).first
	if @contact.destroy
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 ORDER BY "contacts"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 1]]