app/controllers/v1/sessions_controller.rb

def create
	@u1=User.where(email: params[:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "frrf@gmail.com"], ["LIMIT", 1]]