app/controllers/v1/users_controller.rb

	def index
		@users=User.all

		render json: @users.order(created_at: :DESC), status: :ok
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

		def create
			@user=User.new(user_params)

			#byebug

			if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "authentication_token", "uname") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"